/** @type {import('tailwindcss').Config} */
module.exports = {
  // סורק את כל הקבצים שלך כדי למצוא שימוש ב-Classes
  content: [
    './app/**/*.{js,jsx,ts,tsx}', // כל מה שבתיקיית app (כמו index.tsx)
    './src/**/*.{js,jsx,ts,tsx}', // כל מה שבתיקיית src (כמו Avatar.tsx)
    './components/**/*.{js,jsx,ts,tsx}', // אם יש לך תיקיית קומפוננטות חיצונית
  ],
  presets: [require('nativewind/preset')],
  theme: {
    extend: {
      
      colors: {
        // הצבע הראשי (מה שהיה הכתום)
        primary: {
          100: 'rgb(255, 140, 80)', // בהיר מאוד (הייליטים)
          500: 'rgb(242, 89, 18)', // הצבע המרכזי (Default)
          900: 'rgb(180, 60, 10)', // כהה (לחיצה/צל)
        },
        // הצבע המשני (הסגול הבהיר)
        secondary: {
          100: 'rgb(120, 90, 180)',
          500: 'rgb(92, 62, 148)', // הצבע המרכזי
          900: 'rgb(75, 50, 120)',
        },
        // צבעי עומק/שכבות (הסגול הכהה)
        surface: {
          100: 'rgb(85, 60, 130)', // כרטיסים/מודאלים
          500: 'rgb(65, 43, 107)', // גבולות
          900: 'rgb(50, 30, 85)', // צללים פנימיים
        },
        // צבעי בסיס/רקע (הסגול הכי כהה)
        background: {
          100: 'rgb(45, 35, 65)', // רקע משני
          500: 'rgb(33, 24, 50)', // הרקע הראשי של האפליקציה
          900: 'rgb(20, 15, 30)', // כהה מוחלט
        },
      },
    },
  },
  plugins: [],
};
